In [2]:
import pandas as pd
df = pd.read_csv('data/score.csv', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [7]:
df1 = df['이름'].to_frame()
df2 = df['이름']
type(df1)

pandas.core.frame.DataFrame

In [10]:
df[['이름','국어']]

       이름   국어
지원번호
1번    채치수   90
2번    정대만   40
3번    송태섭   80
4번    서태웅   40
5번    강백호   15
6번    변덕규   80
7번    황태산   55
8번    윤대협  100

In [12]:
df2

지원번호
1번    채치수
2번    정대만
3번    송태섭
4번    서태웅
5번    강백호
6번    변덕규
7번    황태산
8번    윤대협
Name: 이름, dtype: object

In [6]:
df1

       이름
지원번호
1번    채치수
2번    정대만
3번    송태섭
4번    서태웅
5번    강백호
6번    변덕규
7번    황태산
8번    윤대협

In [17]:
df[['이름', '국어']][0:-1]

       이름  국어
지원번호
1번    채치수  90
2번    정대만  40
3번    송태섭  80
4번    서태웅  40
5번    강백호  15
6번    변덕규  80
7번    황태산  55

In [18]:
df.iloc[0]

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: 1번, dtype: object

In [28]:
df3 = df.loc['1번', ['이름', '학교']]

In [29]:
df3

이름    채치수
학교    북산고
Name: 1번, dtype: object

In [30]:
type(df3)

pandas.core.series.Series

In [32]:
df4 = df.loc['1번':'5번', '이름':'사회']

In [33]:
type(df4)

pandas.core.frame.DataFrame

In [35]:
df5 = df.iloc[0]

In [36]:
type(df5)

pandas.core.series.Series

In [39]:
df5

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: 1번, dtype: object

In [37]:
df6 = df.iloc[0].to_frame()

In [38]:
df6

          1번
이름       채치수
학교       북산고
키        197
국어        90
영어        85
수학       100
과학        95
사회        85
SW특기  Python

In [43]:
df.iloc[0:5, [0,1,2,3]]

       이름   학교    키  국어
지원번호
1번    채치수  북산고  197  90
2번    정대만  북산고  184  40
3번    송태섭  북산고  168  80
4번    서태웅  북산고  187  40
5번    강백호  북산고  188  15

In [47]:
filt = (df['국어'] >= 80) & (df['사회'] >= 80)
df1 = df[filt]

In [48]:
df1

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
6번    변덕규  능남고  202   80  100   95  85  80       C
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [57]:
df1 =df1.sort_values(['국어','영어'], ascending=[False, False])

In [59]:
df2 =df1.loc[:, ['이름', '국어', '영어']]

In [62]:
df2.iloc[[-1]]

       이름  국어   영어
지원번호
6번    변덕규  80  100